Revit 2027 API
LabelUtils.GetLabelFor(PipeFlowState, Document) Method
 Gets the user-visible name for a PipeFlowState.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	PipeFlowState pipeFlowState,
	Document doc
)
Public Shared Function GetLabelFor (
	pipeFlowState As PipeFlowState,
	doc As Document
) As String
public:
static String^ GetLabelFor(
	PipeFlowState pipeFlowState,
	Document^ doc
)
static member GetLabelFor :
        pipeFlowState : PipeFlowState *
        doc : Document -> string
Parameters
pipeFlowState PipeFlowState
 The PipeFlowState to get the user-visible name.
doc Document
 The document from which to get the PipeFlowState.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when information for the input PipeFlowState cannot be found.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace